# https://github.com/Homebrew/homebrew-bundle

## Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

## Make sure cask installs apps in "/Applications"
# cask_args appdir: "/Applications"


## Basics
brew "coreutils"        # GNU up-to-date coreutils
brew "findutils"        # GNU "find", "locate", etc
brew "bash"             # Newest bash version
brew "bash-completion"
brew "brew-cask-completion"
brew "open-completion"
brew "pip-completion"


## CLI binaries
brew "git"
brew "neovim"
brew "pandoc"
brew "reattach-to-user-namespace"
brew "stow"
brew "tmux", args: ["--with-utf8proc", "--HEAD"]
brew "trash"
brew "wget"
# Not used an more
# brew "hdf5"
# brew "python3"
# brew "ranger"
# brew "vimpager"


## Apps
cask "bettertouchtool"
cask "dropbox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "jdownloader"
cask "karabiner-elements"
cask "plex-media-server"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "vlc"
# Not used an more
# cask "dterm"
# cask "flux"
# cask "java"
# cask "mactex"
# cask "osxfuse"
# cask "slack"
# cask "wkhtmltopdf"

# Quicklook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "betterzipql"
cask "qlimagesize"


## Fonts
cask "font-hack"
# cask "font-source-code-pro"
# cask "font-source-sans-pro"
# cask "font-source-serif-pro"


